Repository: mitodl/edx-sga
Catalog: edx_sga/locale/*/LC_MESSAGES/django.po
Languages: eo, fr

source: Display Name
eo: Dïspläÿ Nämè Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт#
fr: Nom d'affichage

source: Staff Graded Assignment
eo: Stäff Grädéd Àssïgnmént Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σ#
fr: Travail noté par le personel

source: This name appears in the horizontal navigation at the top of the page.
eo: Thïs nämé äppéärs ïn thé hörïzöntäl nävïgätïön ät thé töp öf thé pägé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя #
fr: Ce nom apparaît dans la barre de navigation horizontale en haut de la page.

source: Problem Weight
eo: Prößlém Wéïght Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт#
fr: Pondération du problème

source: Defines the number of points each problem is worth. If the value is not set, the problem is worth the sum of the option point values.
eo: Défïnés thé nümßér öf pöïnts éäçh prößlém ïs wörth. Ìf thé välüé ïs nöt sét, thé prößlém ïs wörth thé süm öf thé öptïön pöïnt välüés.#
fr: Définir la valeur de chaque problème. Si une valeur n'est pas définie, le problème vaut la somme des options de valeurs de point.

source: Maximum score
eo: Mäxïmüm sçöré Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Note maximale

source: Maximum grade score given to assignment by staff.
eo: Mäxïmüm grädé sçöré gïvén tö ässïgnmént ßý stäff. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α#
fr: Note maximale donnée au travail par le personnel.

source: Score assigned by non-instructor staff
eo: Sçöré ässïgnéd ßý nön-ïnstrüçtör stäff Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя#
fr: Note donnée par un personel non-enseignant

source: Score will need to be approved by instructor before being published.
eo: Sçöré wïll nééd tö ßé äpprövéd ßý ïnstrüçtör ßéföré ßéïng püßlïshéd. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя #
fr: La note doit être approuvé par un instructeur avant d'être publiée.

source: Instructor comment
eo: Ìnstrüçtör çömmént Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт#
fr: Commentaire d'un instructeur

source: Feedback given to student by instructor.
eo: Féédßäçk gïvén tö stüdént ßý ïnstrüçtör. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя#
fr: Commentaire donné à l'étudiant par l'instructeur

source: Annotated SHA1
eo: Ànnötätéd SHÀ1 Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт#
fr: SHA1 annoté

source: sha1 of the annotated file uploaded by the instructor for this assignment.
eo: shä1 öf thé ännötätéd fïlé üplöädéd ßý thé ïnstrüçtör för thïs ässïgnmént. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυ#
fr: sha1 du fichier annoté téléversé par l'instructeur pour ce travail.

source: Annotated file name
eo: Ànnötätéd fïlé nämé Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт,#
fr: Nom du fichier annoté

source: The name of the annotated file uploaded for this assignment.
eo: Thé nämé öf thé ännötätéd fïlé üplöädéd för thïs ässïgnmént. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α#
fr: Le nom du fichier annoté téléversé pour ce travail.

source: Mime type of annotated file
eo: Mïmé týpé öf ännötätéd fïlé Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє#
fr: Mimetype du fichier annoté

source: The mimetype of the annotated file uploaded for this assignment.
eo: Thé mïmétýpé öf thé ännötätéd fïlé üplöädéd för thïs ässïgnmént. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α#
fr: Le mimetype du fichier téléversé pour ce travail.

source: Timestamp
eo: Tïméstämp Ⱡ'σяєм ιρѕυм ∂σł#
fr: Horodatage

source: When the annotated file was uploaded
eo: Whén thé ännötätéd fïlé wäs üplöädéd Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυ#
fr: Quand le fichier annoté a été téléversé

source: Show Answer
eo: Shöw Ànswér Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Afficher la réponse

source: Defines when to show the answer to the problem. A default value can be set in Advanced Settings.
eo: Défïnès whén tö shöw thè ânswêr tô thê pröblèm. Ä dèfäùlt vàlùé càn bè sét ïn Àdvàncéd Sèttïngs.
fr: Définir quand afficher la réponse du problème. Une valeur par défaut est définiedans les Paramètres Avancés.

source: Always
eo: Älwàys Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Toujours

source: Answered
eo: Ànswêrèd Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Répondu

source: Attempted
eo: Ättèmptéd Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Tenté

source: Closed
eo: Çlösèd Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Fermé

source: Finished
eo: Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Terminé

source: Correct or Past Due
eo: Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Correct ou en retard

source: Past Due
eo: Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: En retard

source: Never
eo: Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Jamais

source: Solution to the problem to show to the user
eo: Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Solution du problème à afficher à l'utilisateur

source: Solution
eo: Sölutïön Ⱡ'σяєм ιρѕυм ∂#

source: Upload a different file
eo: Ûplöäd ä dïfférént fïlé Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σ#
fr: Téléverser un fichier différent

source: Upload your assignment
eo: Ûplöäd ýöür ässïgnmént Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢#
fr: Téléverser votre travail

source: File uploaded
eo: Fïlé üplöädéd Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Fichier téléversé

source: Your score is <%%= graded.score %%> / <%%= max_score %%>
eo: Ýöür sçöré ïs <%%= graded.score %%> / <%%= max_score %%> Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σ#
fr: Votre note est <%%= graded.score %%> / <%%= max_score %%>

source: Annotated file from instructor
eo: Ànnötätéd fïlé fröm ïnstrüçtör Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢т#
fr: Fichier annoté par l'instructeur

source: This assignment has not yet been graded.
eo: Thïs ässïgnmént häs nöt ýét ßéén grädéd. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢т#
fr: Ce travail n'a pas encore été noté.

source: Username
eo: Ûsérnämé Ⱡ'σяєм ιρѕυм ∂#
fr: Nom d'utilisateur

source: Name
eo: Nämé Ⱡ'σяєм ι#
fr: Nom

source: Filename
eo: Fïlénämé Ⱡ'σяєм ιρѕυм ∂#
fr: Nom du fichier

source: Uploaded
eo: Ûplöädéd Ⱡ'σяєм ιρѕυм ∂#
fr: Téléversé

source: Submitted
eo: Süßmïttèd Ⱡ'σяєм ιρѕυ#
fr: Soumis

source: Grade
eo: Grädé Ⱡ'σяєм ιρѕ#
fr: Note

source: Instructor's comments
eo: Ìnstrüçtör's çömménts Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, #
fr: Commentaires de l'instructeur

source: Annotated
eo: Ànnötätéd Ⱡ'σяєм ιρѕυм ∂σł#
fr: Annoté

source: Actions
eo: Àçtïöns Ⱡ'σяєм ιρѕυм #

source: Yes
eo: Ÿès Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢#
fr: Oui

source: No
eo: Nö Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢#
fr: Non

source: Awaiting instructor approval
eo: Àwäïtïng ïnstrüçtör äppröväl Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢#
fr: En attentte de la revue d'un instructeur

source: Approve grade
eo: Àpprövé grädé Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Approuver la note

source: Enter grade
eo: Éntér grädé Ⱡ'σяєм ιρѕυм ∂σłσя #
fr: Entrer une note

source: Upload annotated file
eo: Ûplöäd ännötätéd fïlé Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, #
fr: Téléverser un fichier annoté

source: Grade Submissions
eo: Grädé Süßmïssïöns Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмє#
fr: Soumettre les notes

source: Download All Submissions
eo: Döwnlöäd Àll Süßmïssïöns Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмє#
fr: Télécharger toutes les soumissions

source: Loading...
eo: Löädïng... Ⱡ'σяєм ιρѕυм ∂σłσ#
fr: Chargement...

source: Staff Debug
eo: Stäff Déßüg Ⱡ'σяєм ιρѕυм ∂σłσя #
fr: Déboguage pour l'équipe

source: is_released
eo: ïs_réléäséd Ⱡ'σяєм ιρѕυм ∂σłσя #

source: location
eo: löçätïön Ⱡ'σяєм ιρѕυм ∂#

source: Module Fields
eo: Mödülé Fïélds Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Champs module

source: category
eo: çätégörý Ⱡ'σяєм ιρѕυм ∂#
fr: catégorie

source: Enter Grade
eo: Éntér Grädé Ⱡ'σяєм ιρѕυм ∂σłσя #
fr: Entrer Note

source: Grade for %(student_name)s
eo: Grädé för %(student_name)s Ⱡ'σяєм ιρѕυм ∂σłσя ѕι#
fr: Note de %(student_name)s

source: Grade:
eo: Grädé: Ⱡ'σяєм ιρѕυ#
fr: Note:

source: Comment:
eo: Çömmént: Ⱡ'σяєм ιρѕυм ∂#
fr: Commentaire:

source: Submit
eo: Süßmït Ⱡ'σяєм ιρѕυ#
fr: Soumettre

source: Cancel
eo: Çänçél Ⱡ'σяєм ιρѕυ#
fr: Annuler

source: Remove grade
eo: Rémövé grädé Ⱡ'σяєм ιρѕυм ∂σłσя ѕ#
fr: Enlever note
