Repository: mitodl/edx-sga
Catalog: edx_sga/locale/*/LC_MESSAGES/djangojs.po
Languages: eo, fr

source: Started preparing student submissions zip file. This may take a while.
eo: Stärtéd prépärïng stüdént süßmïssïöns zïp fïlé. Thïs mäý täké ä whïlé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя #
fr: Préparation du fichier zip des soumissions étudiantes. Ceci prendra un moment.

source: Submission failed. Please contact your course instructor.
eo: Süßmïssïön fäïléd. Pléäsé çöntäçt ýöür çöürsé ïnstrüçtör. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α#
fr: Soumission échouée. Veuillez contacter votre responsable de cours.

source: Uploading...
eo: Ûplöädïng... Ⱡ'σяєм ιρѕυм ∂σłσя ѕ#
fr: En téléversement...

source: The file you are trying to upload is too large.
eo: Thé fïlé ýöü äré trýïng tö üplöäd ïs töö lärgé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α#
fr: Le fichier que vous essayez de téléverser est trop grand.

source: There was an error uploading your file.
eo: Théré wäs än érrör üplöädïng ýöür fïlé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя#
fr: Une erreur est survenue durant le téléversement.

source: Uploading... %(percent)s %
eo: Ûplöädïng... %(percent)s % Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт#
fr: En téléversement... %(percent)s %

source: yes
eo: ýés Ⱡ'σяєм#
fr: oui

source: Grade must be a number.
eo: Grädé müst ßé ä nümßér. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σ#
fr: La note doit être un chiffre.

source: Grade must be an integer.
eo: Grädé müst ßé än ïntégér. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕ#
fr: La note doit être un entier.

source: Grade must be positive.
eo: Grädé müst ßé pösïtïvé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σ#
fr: La note doit être un chiffre positif

source: Maximum score is %(max_score)s
eo: Mäxïmüm sçöré ïs %(max_score)s Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, #
fr: La note maximale est %(max_score)s

source: No grade to remove.
eo: Nö grädé tö rémövé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт,#
fr: Aucune note à enlever.

source: The download file was not created. Please try again or contact %(support_email)s
eo: Thé döwnlöäd fïlé wäs nöt çréätéd. Pléäsé trý ägäïn ör çöntäçt %(support_email)s Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя #
fr: Le fichier de téléchargement n'a pas été créé. Veuillez réessayer ou contacter %(support_email)s

source: Student submission file ready for download
eo: Stüdént süßmïssïön fïlé réädý för döwnlöäd Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя #
fr: Le fichier de soumission des étudiants est prêt à être téléchargé
