Repository: mitodl/edx-sga
Catalog: edx_sga/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: Display Name
rtl: يهسحمشغ رشوث

source: Staff Graded Assignment
rtl: سفشبب لقشيثي شسسهلروثرف

source: This name appears in the horizontal navigation at the top of the page.
rtl: فاهس رشوث شححثشقس هر فاث اخقهظخرفشم رشدهلشفهخر شف فاث فخح خب فاث حشلث.

source: Problem Weight
rtl: حقخزمثو صثهلاف

source: Defines the number of points each problem is worth. If the value is not set, the problem is worth the sum of the option point values.
rtl: يثبهرثس فاث رعوزثق خب حخهرفس ثشذا حقخزمثو هس صخقفا. هب فاث دشمعث هس رخف سثف, فاث حقخزمثو هس صخقفا فاث سعو خب فاث خحفهخر حخهرف دشمعثس.

source: Maximum score
rtl: وشطهوعو سذخقث

source: Maximum grade score given to assignment by staff.
rtl: وشطهوعو لقشيث سذخقث لهدثر فخ شسسهلروثرف زغ سفشبب.

source: Score assigned by non-instructor staff
rtl: سذخقث شسسهلرثي زغ رخر-هرسفقعذفخق سفشبب

source: Score will need to be approved by instructor before being published.
rtl: سذخقث صهمم رثثي فخ زث شححقخدثي زغ هرسفقعذفخق زثبخقث زثهرل حعزمهساثي.

source: Instructor comment
rtl: هرسفقعذفخق ذخووثرف

source: Feedback given to student by instructor.
rtl: بثثيزشذن لهدثر فخ سفعيثرف زغ هرسفقعذفخق.

source: Annotated SHA1
rtl: شررخفشفثي ساش1

source: sha1 of the annotated file uploaded by the instructor for this assignment.
rtl: ساش1 خب فاث شررخفشفثي بهمث عحمخشيثي زغ فاث هرسفقعذفخق بخق فاهس شسسهلروثرف.

source: Annotated file name
rtl: شررخفشفثي بهمث رشوث

source: The name of the annotated file uploaded for this assignment.
rtl: فاث رشوث خب فاث شررخفشفثي بهمث عحمخشيثي بخق فاهس شسسهلروثرف.

source: Mime type of annotated file
rtl: وهوث فغحث خب شررخفشفثي بهمث

source: The mimetype of the annotated file uploaded for this assignment.
rtl: فاث وهوثفغحث خب فاث شررخفشفثي بهمث عحمخشيثي بخق فاهس شسسهلروثرف.

source: Timestamp
rtl: فهوثسفشوح

source: When the annotated file was uploaded
rtl: صاثر فاث شررخفشفثي بهمث صشس عحمخشيثي

source: Show Answer
rtl: ساخص شرسصثق

source: Defines when to show the answer to the problem. A default value can be set in Advanced Settings.
rtl: يثبهرثس صاثر فخ ساخص فاث شرسصثق فخ فاث حقخزمثو. ش يثبشعمف دشمعث ذشر زث سثف هر شيدشرذثي سثففهرلس.

source: Always
rtl: شمصشغس

source: Answered
rtl: شرسصثقثي

source: Attempted
rtl: شففثوحفثي

source: Closed
rtl: ذمخسثي

source: Finished
rtl: بهرهساثي

source: Correct or Past Due
rtl: ذخققثذف خق حشسف يعث

source: Past Due
rtl: حشسف يعث

source: Never
rtl: رثدثق

source: Solution to the problem to show to the user
rtl: سخمعفهخر فخ فاث حقخزمثو فخ ساخص فخ فاث عسثق

source: Solution
rtl: سخمعفهخر

source: Upload a different file
rtl: عحمخشي ش يهببثقثرف بهمث

source: Upload your assignment
rtl: عحمخشي غخعق شسسهلروثرف

source: File uploaded
rtl: بهمث عحمخشيثي

source: Your score is <%%= graded.score %%> / <%%= max_score %%>
rtl: غخعق سذخقث هس <%%= graded.score %%> / <%%= max_score %%>

source: Annotated file from instructor
rtl: شررخفشفثي بهمث بقخو هرسفقعذفخق

source: This assignment has not yet been graded.
rtl: فاهس شسسهلروثرف اشس رخف غثف زثثر لقشيثي.

source: Username
rtl: عسثقرشوث

source: Name
rtl: رشوث

source: Filename
rtl: بهمثرشوث

source: Uploaded
rtl: عحمخشيثي

source: Submitted
rtl: سعزوهففثي

source: Grade
rtl: لقشيث

source: Instructor's comments
rtl: هرسفقعذفخق'س ذخووثرفس

source: Annotated
rtl: شررخفشفثي

source: Actions
rtl: شذفهخرس

source: Yes
rtl: غثس

source: No
rtl: رخ

source: Awaiting instructor approval
rtl: شصشهفهرل هرسفقعذفخق شححقخدشم

source: Approve grade
rtl: شححقخدث لقشيث

source: Enter grade
rtl: ثرفثق لقشيث

source: Upload annotated file
rtl: عحمخشي شررخفشفثي بهمث

source: Grade Submissions
rtl: لقشيث سعزوهسسهخرس

source: Download All Submissions
rtl: يخصرمخشي شمم سعزوهسسهخرس

source: Loading...
rtl: مخشيهرل...

source: Staff Debug
rtl: سفشبب يثزعل

source: is_released
rtl: هس_قثمثشسثي

source: location
rtl: مخذشفهخر

source: Module Fields
rtl: وخيعمث بهثميس

source: category
rtl: ذشفثلخقغ

source: Enter Grade
rtl: ثرفثق لقشيث

source: Grade for %(student_name)s
rtl: لقشيث بخق %(student_name)s

source: Grade:
rtl: لقشيث:

source: Comment:
rtl: ذخووثرف:

source: Submit
rtl: سعزوهف

source: Cancel
rtl: ذشرذثم

source: Remove grade
rtl: قثوخدث لقشيث
