Repository: mitodl/edx-sga
Catalog: edx_sga/locale/rtl/LC_MESSAGES/djangojs.po
Languages: rtl

source: Started preparing student submissions zip file. This may take a while.
rtl: سفشقفثي حقثحشقهرل سفعيثرف سعزوهسسهخرس ظهح بهمث. فاهس وشغ فشنث ش صاهمث.

source: Submission failed. Please contact your course instructor.
rtl: سعزوهسسهخر بشهمثي. حمثشسث ذخرفشذف غخعق ذخعقسث هرسفقعذفخق.

source: Uploading...
rtl: عحمخشيهرل...

source: The file you are trying to upload is too large.
rtl: فاث بهمث غخع شقث فقغهرل فخ عحمخشي هس فخخ مشقلث.

source: There was an error uploading your file.
rtl: فاثقث صشس شر ثققخق عحمخشيهرل غخعق بهمث.

source: Uploading... %(percent)s %
rtl: عحمخشيهرل... %(percent)s %

source: yes
rtl: غثس

source: Grade must be a number.
rtl: لقشيث وعسف زث ش رعوزثق.

source: Grade must be an integer.
rtl: لقشيث وعسف زث شر هرفثلثق.

source: Grade must be positive.
rtl: لقشيث وعسف زث حخسهفهدث.

source: Maximum score is %(max_score)s
rtl: وشطهوعو سذخقث هس %(max_score)s

source: No grade to remove.
rtl: رخ لقشيث فخ قثوخدث.

source: The download file was not created. Please try again or contact %(support_email)s
rtl: فاث يخصرمخشي بهمث صشس رخف ذقثشفثي. حمثشسث فقغ شلشهر خق ذخرفشذف %(support_email)s

source: Student submission file ready for download
rtl: سفعيثرف سعزوهسسهخر بهمث قثشيغ بخق يخصرمخشي
